#define _CRT_SECURE_NO_WARNINGS 1

//context:操作符详解01;
//time:2021年2月25日12:10:13;
//author:lizi;

#include<stdio.h>

//算术操作符
//int main()
//{
//	int a = 5 / 2;//商2余1
//	//double a = 5 / 2.0;//商2余1
//	printf("a=%lf", a);//a=2
//	return 0;
//}

//移位操作符
//int main()
//{
//	int a = 16;
//	//>>右移操作符，对二进制位进行操作
//	//00000000000000000000000000010000
//	int b = a >> 1;
//	//算术右移
//	//00000000000000000000000000001000
//	printf("%d", b);
//	return 0;
//}

//位操作符
//int main()
//{
//	////&-按二进制位与
//	//int a = 3;
//	//int b = 5;
//	////int c = a & b;
//	//按位或
//	//int c = a | b;
//	////00000000000000000000000000000011
//	////00000000000000000000000000000101
//	////&后
//	////00000000000000000000000000000001
//	////十进制为1
//	////按位或后
//	////00000000000000000000000000000111
//	////十进制为7
//	//printf("c=%d", c);
//	//return 0;
//
//	//按位异或
//	int a = 3;
//	int b = 5;
//	int c = a ^ b;
//	//00000000000000000000000000000011
//	//00000000000000000000000000000101
//	//^后
//	//相同为0，相异为1
//	//00000000000000000000000000000110
//	//十进制为6
//	printf("c=%d", c);
//	return 0;
//}

//不创建第三个临时变量的情况下交换两个数
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//	return 0;
//}

struct Stu
{
	char name[10];
	int age;
	char id[20];
};
int main()
{
	struct Stu S1 = { "张三",20,"20177030140" };
	struct Stu* p = &S1;
	printf("%s", p->name);
	return 0;
}